eisup_2019_docmng_integration/src/Documents/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеБюджетныхАналитик</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяОборотов</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТипКонтрагента</name>
      <type>
        <types>CatalogRef.абс_ТипыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеБиллинговыхУслуг</name>
    <attributes>
      <name>ТипБиллинга</name>
      <type>
        <types>CatalogRef.абс_ТипыБиллинга</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеУслуги</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУслугиБиллинга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>этоМГМН</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовПервичныхДокументов/абс_ИзменениеСтатусовПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовПервичныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственного</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.kwr_ИнтеграцияСHyperion</types>
      <types>DocumentRef.ttk_ЗагрузкаНачисленийИзБиллинга</types>
      <types>DocumentRef.ttk_НастройкаСоответствияСчетовБУКСтатьямВГО</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.ttk_ДекларацияБиллинг</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежей</types>
      <types>DocumentRef.ttk_СверкаВГО</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеБиллинговыхУслугНоменклатуре/абс_СоответствиеБиллинговыхУслугНоменклатуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеБиллинговыхУслугНоменклатуре</name>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипБиллинга</name>
    <type>
      <types>CatalogRef.абс_ТипыБиллинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаименованиеУслуги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУслугиБиллинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>этоМГМН</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеНоменклатурыБюджетнымАналитикам/абс_СоответствиеНоменклатурыБюджетнымАналитикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеНоменклатурыБюджетнымАналитикам</name>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПервичныхДокументов/абс_СтатусыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПервичныхДокументов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПринятыБухгалтером</name>
    <comment>Обработка принятых документов (до оптимизации 2018)</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>УточнениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УточнениеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДокумента</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Источник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Приемник</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДиректоромДирекции</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
    <comment>Департамент казначейства</comment>
  </enumValues>
  <enumValues>
    <name>СогласованиеОЭФ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомКЦ</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДД</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыНоменклатуры/абс_СтатусыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыНоменклатуры</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Использование</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласование</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам/ObjectModule.bsl
Функция ОпределитьИспользованиеБюджетнойСтатьи(Дт, БС)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатьиОборотовПоБюджетамабс_ПериодыИспользования.Ссылка,
		|	СтатьиОборотовПоБюджетамабс_ПериодыИспользования.Ссылка.Код,
		|	СтатьиОборотовПоБюджетамабс_ПериодыИспользования.Период,
		|	СтатьиОборотовПоБюджетамабс_ПериодыИспользования.Использование
		|ИЗ
		|	Справочник.СтатьиОборотовПоБюджетам.абс_ПериодыИспользования КАК СтатьиОборотовПоБюджетамабс_ПериодыИспользования
		|ГДЕ
		|	&Дт МЕЖДУ НАЧАЛОПЕРИОДА(СтатьиОборотовПоБюджетамабс_ПериодыИспользования.Период, ГОД) И КОНЕЦПЕРИОДА(СтатьиОборотовПоБюджетамабс_ПериодыИспользования.Период, ГОД)
		|	И СтатьиОборотовПоБюджетамабс_ПериодыИспользования.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Дт", Дт);
	Запрос.УстановитьПараметр("Ссылка", БС);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.Количество();
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
		Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовПервичныхДокументов.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ПервичныйДокумент.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера(); //ТекущаяДата();  АБС Коломиец 17233
	Запись.ПервичныйДокумент = Ссылка;
	Запись.Пользователь = ТекПользователь;	
	Запись.СтатусДокумента = Статус;	
	Запись.Комментарий = Комментарий;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
	СоответствиеБюджетныхАналитик.Очистить();
	СоответствиеБиллинговыхУслуг.Очистить();
	Комментарий = "";
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.абс_СтатусыПервичныхДокументов.Согласован Тогда		
		Для Каждого Стр Из СоответствиеБюджетныхАналитик Цикл
			Если ЗначениеЗаполнено(Стр.СтатьяОборотов) Тогда
				БС = ОпределитьИспользованиеБюджетнойСтатьи(Дата, Стр.СтатьяОборотов);
				Если БС = 0 Тогда				
					Сообщить("В строке " + Строка(Стр.НомерСтроки) + " статья оборотов '" + Строка(Стр.СтатьяОборотов) + "' не используется в периоде " + Формат(Год(Дата), "ЧЦ=4; ЧГ=0"));
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//
		НаборСоответствияНБУ = РегистрыСведений.абс_СоответствиеБиллинговыхУслугНоменклатуре.СоздатьНаборЗаписей();
		НаборСоответствияНБУ.Отбор.Организация.Установить(Организация);
		Для Каждого ЗаписьНБУ Из СоответствиеБиллинговыхУслуг Цикл
        	НоваяЗаписьНБУ = НаборСоответствияНБУ.Добавить();
			НоваяЗаписьНБУ.Организация = Организация;
			НоваяЗаписьНБУ.ТипБиллинга = ЗаписьНБУ.ТипБиллинга;
			НоваяЗаписьНБУ.НаименованиеУслуги = СокрЛП(ЗаписьНБУ.НаименованиеУслуги);
			НоваяЗаписьНБУ.КодУслугиБиллинга = СокрЛП(ЗаписьНБУ.КодУслугиБиллинга);
			НоваяЗаписьНБУ.Номенклатура = ЗаписьНБУ.Номенклатура;
			НоваяЗаписьНБУ.этоМГМН = ЗаписьНБУ.этоМГМН;
			НоваяЗаписьНБУ.ДокументРегистратор = Ссылка;
			Если ЗаписьНБУ.Номенклатура.абс_СтатусНоменклатуры <> Перечисления.абс_СтатусыНоменклатуры.Использование Тогда
				НоменклатураОбъект = ЗаписьНБУ.Номенклатура.ПолучитьОбъект();
				НоменклатураОбъект.ЗаписатьНовыйСтатус(Перечисления.абс_СтатусыНоменклатуры.Использование, "Автоматический перевод статуса документом: " + Строка(Ссылка));
				НоменклатураОбъект.абс_СтатусНоменклатуры = Перечисления.абс_СтатусыНоменклатуры.Использование;
				НоменклатураОбъект.Записать();				
			КонецЕсли;
		КонецЦикла;
		НаборСоответствияНБУ.Записать();
		//
		НаборСоответствияНБА = РегистрыСведений.абс_СоответствиеНоменклатурыБюджетнымАналитикам.СоздатьНаборЗаписей();
		НаборСоответствияНБА.Отбор.Организация.Установить(Организация);		
		Для Каждого ЗаписьНБА Из СоответствиеБюджетныхАналитик Цикл
        	НоваяЗаписьНБА = НаборСоответствияНБА.Добавить();
			НоваяЗаписьНБА.Организация = Организация;
			НоваяЗаписьНБА.Номенклатура = ЗаписьНБА.Номенклатура;
			НоваяЗаписьНБА.абс_ЦФУ = ЗаписьНБА.ЦФУ;
			НоваяЗаписьНБА.СтатьяОборотов = ЗаписьНБА.СтатьяОборотов;
			НоваяЗаписьНБА.абс_ТипКонтрагента = ЗаписьНБА.абс_ТипКонтрагента;
			НоваяЗаписьНБА.ЦФО = ЗаписьНБА.ЦФО;
			НоваяЗаписьНБА.НоменклатурнаяГруппа = ЗаписьНБА.НоменклатурнаяГруппа;
			НоваяЗаписьНБА.ДокументРегистратор = Ссылка;
			Если ЗаписьНБА.Номенклатура.абс_СтатусНоменклатуры <> Перечисления.абс_СтатусыНоменклатуры.Использование Тогда
				НоменклатураОбъект = ЗаписьНБА.Номенклатура.ПолучитьОбъект();
				НоменклатураОбъект.ЗаписатьНовыйСтатус(Перечисления.абс_СтатусыНоменклатуры.Использование, "Автоматический перевод статуса документом: " + Строка(Ссылка));
				НоменклатураОбъект.абс_СтатусНоменклатуры = Перечисления.абс_СтатусыНоменклатуры.Использование;
				НоменклатураОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
		НаборСоответствияНБА.Записать();
	КонецЕсли;
	
КонецПроцедуры
